PGML-BL/OpenFoam_Laminar/laminarFlatPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7-20190902
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          55;
        startFace       4850;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          45;
        startFace       4905;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          45;
        startFace       4950;
    }
    plate
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          35;
        startFace       4995;
    }
    symmBound
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       5030;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4950;
        startFace       5050;
    }
)

// ************************************************************************* //
