PGML-BL/OpenFoam_Laminar/laminarFlatPlate/system/sampleDictv7
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

writeFormat     raw;

sampleSets
(
    uniform
    {
	name		x005;
	axis		y;
	start		(0.005 0.01 0.0005);
	end		(0.005 0.0   0.0005);
	nPoints		100;
    }
    uniform
    {
	name		x015;
	axis		y;
	start		(0.015 0.01 0.0005);
	end		(0.015 0.0   0.0005);
	nPoints		100;
    }
    uniform
    {
	name		x025;
	axis		y;
	start		(0.025 0.01 0.0005);
	end		(0.025 0.0   0.0005);
	nPoints		100;
    }
    uniform
    {
	name		x030;
	axis		y;
	start		(0.03 0.01 0.0005);
	end		(0.03 0.0   0.0005);
	nPoints		100;
    }
);

fields
(
    U.component(0)
    T
);

// ************************************************************************* //
